//1.数组的定义
//#include<stdio.h>
//int main()
//{
//	int i = 0;
//	int arr[10];//定义了一个存放了10个整数数字的数组        数组的每个元素都单独占一个所定义的空间大小，比如每个int元素就占4个字节
//	char ch[20];//类似上面
//	int arr2[11] = { 1,2,3,4,5,6,7,8,9,10 };//数组的定义   类型+名字[]={} 注意后面是大括号，里面是存放的元素
//	int arr3[] = { 11,22,33,44,55,66,77,88 };//也可以不写数组元素个数来初始化
//	//printf("%d\n", arr2[1]);
//	//printf("%d\n", arr3[1]);
//	printf("%d\n", arr2[5]);
//	arr2[10] = 65;
//	printf("%d\n", arr2[10]);
//	/*while (i <8)
//	{
//		printf("%d\n", arr3[i]);
//		i++;
//	}
//	return 0;*/
//}

//如果定义过了一个数组，使用scanf输入到数组中元素时不用在输入&符号
//eg：
//char arr[];
//scanf("%s", arr);

//数组的本质是地址

//定义数组，数组初始化的时候a[]这个中括号里面放的只能是常量，不能放变量

//数组中空格  也算一个字符

//用char定义的字符串数组的最后一位会放一个\0，用下标获取数组里的字符串的元素时，或者计算字符串里面的元素是需要注意char[]={"uqwieiuhiu\0}，\0会占一位元素但不会显示出来
//int 定义的就没有,字符串数组里面才会存在\0,还占内存空间的那种
//sizeof在计算字符数组大小的过程中，会将\0这个字符占用的空间也计算进去。但是strlen计算字符个数并不会计算进去

//数组形式的参数，接受的实际上是实参的第一个元素的地址。数组中的元素的地址都是相邻的。数组的第一个地址++，就是指到下一个元素

//数组形式的参数，虽然实际上传递的是地址，但是使用的时候还是以数组的格式进行操作

//补充：int arr[4];   在arr[3]这个变量的意思代表着arr这个首元素地址+3    即*（arr+3)

