//1.  计算机 存储数据

//在有符号位的二进制数字中，0表示正数，1表示负数

//由于操作寄存器的速度远高于操作内存，但寄存器的数量有限，所以把最频繁使用的数据存储在寄存器里，有效地提高程序运行速率。”

//寄存器    同时也是一个关键字 register 能够定义寄存器变量
//高速缓存
//内存     8/4/16  g内存               这四个访问速度自上而下由高到低，但是内存大小是由低到高
//硬盘     500g
//
//
//
//cpu  即中央处理器      我们的数据内存拿出，进入cpu处理
// 
// 
//#include<stdio.h>
//int main()
//{
//	//register int a = 10;//建议把a定义为寄存器变量，到底有没有放进去寄存器，取决于编译器判断是否放入,一般用于计数器
//	int a = 10;
//	printf("%d", a);
//	//int 定义的变量是有符号的,二进制最前面的那一位是符号位
//	//int=signed int   即定义一个有符号的整形，即二进制最前面的一位表示数字
//	//无符号数   unsigned int num=0,这个定义的num没有符号位，即二进制最前面的一位不表示正负数。即使赋值一个负数，输出的仍然是负数
//	return 0;
//}

//unsigned无符号定义的关键字不能用来表示负数，它定义int整型范围是0~二进制111111111111111

//struct 结构体关键字

//volatile

//补充：二进制数组的表示形式 0bxxxxxxxx,这样表示的二进制数字只有正数
