//1.字符串
//#include<stdio.h>
//#include<string.h>//因为使用了strlen函数，所以要调用
//int main()
//{//char是定义的字符
//	//"这是一段字符串";//被""双引号引起来得到一串字符称为字符串字面值，简称字符串      打印或者定义字符串用的是printf（"%s",字符串）
//	char arr1[] = "abc";//这个会被单独拆开，而且会默认是'a','b','c','\0',最后一个'\0'是结束符的意思,""  哪怕是空格也是字符串，这叫空字符串         
//	 //数组的定义  类型+名字[数组元素个数]，char ch[10]；或者char ch[]={'a','b'}，[]里面的数字如果不写会自动初始化元素个数
//
//	printf("%s\n", arr1);//不能用%s来输出数组中的单个字符，这样想输出所有的字符不能定义数组的个数否则也会报错
//
//	printf("arr1最后一位是：%c\n", arr1[3]);//  "\0"就是字符串的结束标志，并不算字符串的内容
//
//	printf("有没有第5位%c\n", arr1[4]);//在最开始没有直接去定义
//		char arr2[] = {'a','b','c',0};
//		printf("%s\n", arr2);
//		printf("%c\n证明是有一个元素的%c\n", arr2[2], arr2[3]);//在定义的字符串中，最后面的零在没有单引号的情况下是作为结束符号的。
//		printf(" arr1的长度：%d\n arr2的长度：%d", strlen(arr1), strlen(arr2));//strlen()---string length，计算字符串长度的,显示的是字符的个数
//	return 0;
//
//}//记得看看ascll码

//2.转义字符
//#include<stdio.h>
//#include<string.h>
//int main()
//{
//	printf("(are you ok\?\?)\n");//这个编译器比较新没有,但是老版的会有如vc6.0  三字母词-----？？+内容   这样的形式会改变它输出的内容   即？？）等于]  在书写多个连续的？时使用
//	//防止被解析成三字母词
//	printf("c:\\test\\32\\tesc\n");//  "\t"---水平制表符，如果想输出，就在"/"前面再加一个"/"
//
//	printf("输出了一个：%c", '\'');//单独输出字符时要用  ''  引起来，但是要输出的是 ' 时，就得用到转义字符了
//
//	printf("%s\n", "abc");
//
//	printf("这个字符的长度是：%zd\n", strlen("c:\test\32\tes\n\0"));//测试长度输出的整数，其%d前要加一个z，表示size_t    转义字符算长度，除了那个"\0"不算
//	                                                                  //\0 在计算字符长度中只算结束符号，并不算作长度
//	
//	printf("%c\n%d\n", '\32', '\32');//"\ddd"(d是数字）  代表的是八进制数字，32是两个八进制数字，在字符中代表的是将"32"转换为十进制数字，作为ascll码代表的字符 
//	                    //32-->十进制数字26-->ascll码是26的字符
//	                    //类似的还有"\xdd"  dd表示两个十六进制的数字，这个转义用到的就是"\x"
//	printf("%d", '\x32');
//
//	return 0;
//	}
//\b---含义是，将光标从当前位置向前（左）移动一个字符（遇到\n或\r则停止移动），并从此位置开始输出后面的字符（空字符\0和换行符\n除外）。
 

//sizeof是一个操作符，所以后面的括号能省略，函数关键字后面的括号并不能省略

//字符串并不能用==来比较是否相等，需要用专门的函数strcmp来比较

//字符'1'-'0'其实是利用了ascll码值相加减，计算时一定要注意

//单个的汉字也算是字符串，需要用双引号引出来



